
//1
//Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".

 /*

function drawTriangle (height, symbol) {
    for (let x = 1 ; x <= height; x++) {
      let line = '';
    for (let y = 1; y <= x; y++) {
      line = symbol + line; 
      }
      console.log(line);
   }
  }
    drawTriangle (5, '*');

*/

// 2
//Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.


/*
let sum = 0;
for (let x = 1; x <= 100; x++) {
    if (x % 3 !== 0); { 
   sum = sum + x;
}  
}
  console.log(sum); 

*/

//3 

//Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
//Наприклад pow(2,3) функція поверне значення 8. 

function pow(x, y) {

let result = 1;
for (i = 0; i < y; i++) {
    result *= x; 
}
console.log(result);
}

let result = pow(2,3);
